fpm_golden_runs/fpm_h100_qwen32_tp8_8k1k_pareto_20260624_011804/e2e/bench_c1.log
INFO 06-24 02:03:42 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 06-24 02:03:42 [nixl_utils.py:32] NIXL is available
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x787b21ba0a40>, trust_remote_code=False, seed=0, num_prompts=20, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=8192, random_output_len=1024, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8001', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='Qwen/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='e2e_c1.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-3dbbf1f0-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-24 02:03:45 [utils.py:90] Sampling input_len from [8192, 8192] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 20/20 [02:11<00:00,  6.55s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     20        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  131.01    
Total input tokens:                      163840    
Total generated tokens:                  20480     
Request throughput (req/s):              0.15      
Output token throughput (tok/s):         156.33    
Peak output token throughput (tok/s):    162.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1406.96   
---------------Time to First Token----------------
Mean TTFT (ms):                          195.60    
Median TTFT (ms):                        231.30    
P50 TTFT (ms):                           231.30    
P90 TTFT (ms):                           239.35    
P99 TTFT (ms):                           240.38    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.21      
Median TPOT (ms):                        6.21      
P50 TPOT (ms):                           6.21      
P90 TPOT (ms):                           6.22      
P99 TPOT (ms):                           6.22      
---------------Inter-token Latency----------------
Mean ITL (ms):                           6.21      
Median ITL (ms):                         6.22      
P50 ITL (ms):                            6.22      
P90 ITL (ms):                            6.27      
P99 ITL (ms):                            6.35      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          6550.09   
Median E2EL (ms):                        6584.49   
P50 E2EL (ms):                           6584.49   
P90 E2EL (ms):                           6596.24   
P99 E2EL (ms):                           6599.11   
==================================================